Table of Contents
 Class AbstractImporter<T>
Namespace
IdeaStatiCa.BimApiLink.Importers
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class AbstractImporter<T> : BimLinkObject, IImporter<T>, IImporter where T : IIdeaObject
Type Parameters
T
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractImporter<T>
Implements
IImporter<T>
IImporter
Derived
ImporterConnectedMemberIdentifier<T>
ImporterConnectionIdentifier<T>
IntIdentifierImporter<T>
StringIdentifierImporter<T>
Inherited Members
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 Create(IIdentifier)
public IIdeaObject Create(IIdentifier identifier)
Parameters
identifier IIdentifier
Returns
IIdeaObject
 Create(Identifier<T>)
public abstract T Create(Identifier<T> identifier)
Parameters
identifier Identifier<T>
Returns
T
 Create<TObj>(Identifier<TObj>)
public TObj Create<TObj>(Identifier<TObj> identifier) where TObj : IIdeaObject
Parameters
identifier Identifier<TObj>
Returns
TObj
Type Parameters
TObj
 Edit this page